app/controllers/api/lunches_controller.rb

SELECT "lunches".* FROM "lunches"
SELECT "restaurants".* FROM "restaurants" WHERE ((latitude > 40.767971 AND latitude < 40.799565) AND (longitude > -73.981991 AND longitude < -73.935342))
---
    def index
        debugger

        if params[:search]
            debugger
            @lunches = Lunch.joins(:restaurant).search(params[:search][:query])
            debugger
        else
            @lunches = Lunch.all