app/models/lunch.rb

     def self.in_bounds(bounds)

            min_lat = bounds["southWest"]["lat"].to_f
            max_lat = bounds["northEast"]["lat"].to_f
            min_long= bounds["southWest"]["lng"].to_f
            max_long = bounds["northEast"]["lng"].to_f

            records_array = []
            self.all.each do |lunch|
---
SELECT "lunches".* FROM "lunches"