app/models/user.rb

    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "H7AZnRG9Xx38yQT8jRzuIQ"], ["updated_at", "2020-04-06 19:17:00.088243"], ["id", 1]]